<!-- dflook/terraform-github-actions {"workspace":"multiarch-test","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"20d0bd792645f4ff1325d6506738dbda9dedb8193f2bab45d06371e36a840856","plan_job_ref":"Job Test plan target and replace #325 at https://github.com/dflook/terraform-github-actions/actions/runs/4377960090","plan_hash":"788be05cd5d19f718831b470f802fac366ee95a6ef38c9edd2610ab3d85785cb","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __multiarch-test__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "8mCVWgzyYh" -> (known after apply)
  ~ foreach = "h0joNLNIfH" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #325](https://github.com/dflook/terraform-github-actions/actions/runs/4377960090)